
import threading



class UserAuthorizationManager:
    all_bird_names = {
        "жаваранак", "верабей", "бусел", "варона", "цецярук", "сыч", 
        "галуб", "голуб", "качка", "дрозд", "сініца", "шпак", "салаўей",
        "зяблік", "сокал", "арол", "журавель", "чапля", "грак", "ластаўка",
        "свіргуль", "сава", "курганнік", "глушэц", "папугай", "лебедзь",
        "галаўка", "фазан", "канарэйка", "чомга", "бекас", "ківі", "вухань",
        "пугач", "зялёнагрудка", "курыца", "каваль", "гусь", "страўс",
        "іньдзюк", "казарка", "мандарынка", "крыжанка", "шыраканоска",
        "шылахвостка", "чырок", "нырэц", "нырок", "чарнец", "гага", "турпан",
        "сіньга", "маранка", "гогаль", "луток", "савук", "крахаль",
        "курапатка", "перапёлка", "рабчык", "пардва", "гагара", "гагач",
        "паганка", "коўра", "фламінга", "олуша", "пелікан", "баклан",
        "бугай", "кваква", "каравайка", "колпіца", "скапа", "асаед", "каршун", "арлан", "сіп", "грыф", "лунь",
        "ястраб", "шуляк", "канюк", "беркут", "пустальга", "шулёнак",
        "кобчык", "дзербнік", "дрымлюк", "кабец", "балабан", "сапсан",
        "падарожнік", "даўгахвост", "драч", "пастушок", "пагоныч",
        "пагоніч", "чаротніца", "лысуха", "дроп", "стрэпет", "сявец",
        "сеўка", "гальштучнік", "зуёк", "хрустан", "крывок", "хадулачнік",
        "шыладзюб", "марадунка", "перавозчык", "чарняк", "шчогаль",
        "селянец", "паручайнік", "цякун", "случок", "кулон", "вераценнік",
        "грыцук", "каменешарка", "пясочнік", "пясчанка", "верабей",
        "белахвосты", "марскі", "кіркун", "чорнаваллёвік", "чырвонаваллёвік",
        "гразевік", "баталён", "гаршнэп", "стучок", "дубальт", "слонка",
        "плывунчык", "ціркушка", "чайка", "танкадзюбая", "чорнагаловая",
        "клыгун", "шызая", "рагатуха", "клуша", "рагатун", "марская",
        "рыбачка", "крачка", "крычка", "чэграва", "палярная", "паморнік",
        "саджа", "клінтух", "вяхір", "туркаўка", "зязюля", "сіпуха", "сплюшка", "бярозаўка",
        "сіпель", "кугакаўка", "ляляк", "зімародак", "шчурка", "сіваграк", "удод", "круцігалоўка",
        "дзяцел", "жаўна", "грычун", "саракуш", "авяльга", "кукша", "сойка", "сарока",
        "арэхаўка", "каўка", "вусатая сініца", "жаўрук", "свіргуль", "землянка", "лястоўка",
        "маскоўка", "чубатая сініца", "блакітніца", "рэмез", "апалоўнік", "глінянка",
        "паўзунок", "крапіўнік", "валавока", "аляпка", "каралёк", "пячураўка", "перасмешка",
        "чаротаўка", "чарацянка", "мармытуля", "цвыркун", "леска", "валасеніца", "малінаўка",
        "салавей", "кралька", "рудахвостка", "падкаменка", "ерчык", "сіняхвостка", "рабіннік",
        "дзяраба", "завірушка", "пліска", "сітаўка", "свірстун", "амялушка", "стрынакта",
        "дуброўнік", "сняжурка", "пуначка", "берасцянка", "зябок", "юрок", "шчурок", "чаромашнік", "зелянушка",
        "крыжадзюб", "яловік", "чачотка", "чыж", "шчыгел", "канаплянка", "гіль", "таўстадзюб", "верабей"
    }
    
    def __init__(self):
        self.authorized_users = {'irina_199'}
        self.lock = threading.Lock()

    def add_user(self, user, password):
        if password.lower() in UserAuthorizationManager.all_bird_names:
            with self.lock:
                self.authorized_users.add(user)
            return True
        else:
            return False

    def remove_user(self, user, word):
        if word.lower().strip() == "logout":
            with self.lock:
                if user in self.authorized_users:
                    self.authorized_users.remove(user)
            return True
        else:
            return False

    def is_user_authorized(self, user):
        with self.lock:
            return user in self.authorized_users

    def reset_authorized_users(self):
        with self.lock:
            self.authorized_users.clear()
            self.authorized_users.add('irina_199')
            print("Authorized users have been reset.")


auth_manager = UserAuthorizationManager()
